src/DataProcessors/СК_МобСклад/СК_МобСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СК_МобСклад</name>
</mdclass:DataProcessor>

src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fe779ac1-0e7f-489c-ad06-bec9af582428">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d561ee5a-2a87-4205-93af-4902b1247d87">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="75e2d606-c8d4-4cfe-8f96-2eaa5c364409">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/СК_Ячейки/СК_Ячейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СК_Ячейки</name>
  <attributes>
    <name>Ряд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/СК_МобСклад/Forms/ФормаСборкиЗаказа/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);


	Если СтруктураПараметров.Ссылка <> "" Тогда
		ЭтаФорма.Номенклатура = СтруктураПараметров.Номенклатура;
		ЭтаФорма.ДокОсн = СтруктураПараметров.Ссылка;
		ЗаполнитьФорму();
	Иначе
		Сообщить("Не удалось создать документ отгрузки");	
	КонецЕсли;

КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьФорму()
	ЭтаФорма.КоличествоОстаток  = 0;
	ЭтаФорма.КоличествоПоДокументу = 0;
	ЭтаФорма.Элементы.ИнфоТовар.Заголовок = "";
	ЭтаФорма.Элементы.ИнфоТовар.ЦветТекста = WebЦвета.Черный;
	ЭтаФорма.Элементы.ИнфоТовар.Видимость = Ложь;
	ТабЯчеек.Очистить();
	
	ДокСборки = ЭтаФорма.ДокОсн.ПолучитьОбъект();
	
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура",ЭтаФорма.Номенклатура);
	
	СтрокиКол = ДокСборки.Товары.НайтиСтроки(Отбор);
	
	Если СтрокиКол.Количество()>=1 Тогда
		ЭтаФорма.КоличествоПоДокументу = СтрокиКол[0].КоличествоУпаковок;
		
		ТоварВЯчейке = Обработки.СК_МобСклад.ПолучитьЯчейкиПоКоличеству(ЭтаФорма.Номенклатура,ЭтаФорма.КоличествоПоДокументу); 
		
		Если ТоварВЯчейке.Количество()>=1 Тогда

			ТабЯчеек.Загрузить(Обработки.СК_МобСклад.ПреобразоватьМассивВТаблицуЗначений(ТоварВЯчейке));	
			
			СтрокиСобр = ДокСборки.СобранныеТовары.НайтиСтроки(Отбор);
			
			собТовар = 0;
			
			Если СтрокиСобр.Количество()>=1 Тогда
				
				Для сч=0 По СтрокиСобр.Количество()-1 Цикл
					собТовар = собТовар + СтрокиСобр[сч].Количество;		
				КонецЦикла;
			КонецЕсли;
			
			ЭтаФорма.КоличествоОстаток = ЭтаФорма.КоличествоПоДокументу - собТовар;	
			
			Если ЭтаФорма.КоличествоОстаток = 0 Тогда
				ЭтаФорма.Элементы.ИнфоТовар.Заголовок = "Товар весь собран";
				ЭтаФорма.Элементы.ИнформацияПоТовару.Доступность = Ложь;
			Иначе
				
			КонецЕсли;
			
			
		Иначе
			ЭтаФорма.Элементы.ИнфоТовар.Заголовок = "В ячейках нет размещенного товара";  
			ЭтаФорма.Элементы.ИнфоТовар.ЦветТекста = WebЦвета.Красный;
			ЭтаФорма.Элементы.ИнфоТовар.Видимость = Истина;
			ЭтаФорма.Элементы.ИнформацияПоТовару.Доступность = Ложь;
		КонецЕсли;
		
	Иначе
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПоискТоваровВЯчейках(Номенклатура)
	
КонецПроцедуры


&НаКлиенте
Процедура Сохранить(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.Элементы.ШКЯчейки.РедактированиеТекста = Истина;
	АктивироватьПоискЯчейки();

КонецПроцедуры  

&НаКлиенте
Процедура АктивироватьПоискЯчейки() 
	ОчиститьШКСервер(); 
	Элементы.ШКЯчейки.ОбновитьТекстРедактирования();
	Элементы.ШКЯчейки.Видимость = Ложь;
	Элементы.ШКЯчейки.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.ШКЯчейки; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры   

&НаКлиенте
Процедура АктивироватьПоискСканШК() 
	ОчиститьШКСервер(); 
	Элементы.СканШК.ОбновитьТекстРедактирования();
	Элементы.СканШК.Видимость = Ложь;
	Элементы.СканШК.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.СканШК; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСервер()
	ШКЯчейки = "";
	СканШК = "";
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеБуфер(Параметры) Экспорт  
			ЭтаФорма.Элементы.ШКЯчейки.РедактированиеТекста = Истина;
			АктивироватьПоискЯчейки();
КонецПроцедуры


&НаКлиенте
Процедура ШКЯчейкиИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Если Текст = "0000000000001" Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеБуфер", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение,"отгружать из буфера нельзя!!! ",5,"Ошибка");
		
	Иначе	
		ШКЯчейкиИзменениеТекстаРедактированияНаСервере(Текст);
		
		Если Элементы.ИнфоТовар.Заголовок <> "" Тогда
			ЭтаФорма.Элементы.ШКЯчейки.РедактированиеТекста = Истина;
			АктивироватьПоискЯчейки();
		Иначе
			ЭтаФорма.Элементы.СканШК.РедактированиеТекста = Истина;
			АктивироватьПоискСканШК();
			
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ШКЯчейкиИзменениеТекстаРедактированияНаСервере(ШК)

	ЭтаФорма.Элементы.ИнфоТовар.Заголовок = "";
	ЭтаФорма.Элементы.ИнфоТовар.ЦветТекста = WebЦвета.Черный;
	ЭтаФорма.Элементы.ИнфоТовар.Видимость = Ложь; 
	ЭтаФорма.Элементы.Количество.ТолькоПросмотр = Истина;
	ЭтаФорма.Ячейка = Справочники.СК_Ячейки.ПустаяСсылка();
	
	ЯчейкаПоиск = Справочники.СК_Ячейки.НайтиПоРеквизиту("ШтрихКод",СокрЛП(ШК)).Ссылка;
	
	Таб = ТабЯчеек.Выгрузить();
	
	Отбор = Новый Структура ;
	Отбор.Вставить("Ячейка",ЯчейкаПоиск.Наименование); 
	Строки = Таб.НайтиСтроки(Отбор);
	
	Если Строки.Количество() = 1 Тогда
		ЭтаФорма.Ячейка = ЯчейкаПоиск;
		ЭтаФорма.Элементы.Количество.ТолькоПросмотр = Ложь;
	Иначе
		ЭтаФорма.Элементы.ИнфоТовар.Заголовок = "Выберите правильную ячейку";
		ЭтаФорма.Элементы.ИнфоТовар.ЦветТекста = WebЦвета.Красный;
		ЭтаФорма.Элементы.ИнфоТовар.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СканШКИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)

	СК = СканШКИзменениеТекстаРедактированияНаСервере(Текст);
	
	Если СК = 0 Тогда
		ЭтаФорма.Элементы.ШКЯчейки.РедактированиеТекста = Истина;
		АктивироватьПоискЯчейки();
	КонецЕсли;
    КоличествоОстатокПриИзменении();
КонецПроцедуры

&НаСервере
Функция СканШКИзменениеТекстаРедактированияНаСервере(Шк)
	
	ЭтаФорма.Элементы.ИнфоТовар.Заголовок = "";  
	ЭтаФорма.Элементы.ИнфоТовар.Видимость = Ложь;
			

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК ВналичииОстаток
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
	|		ПО (ШтрихкодыНоменклатуры.Номенклатура = СК_ТоварыНаСкладахОстатки.Номенклатура)
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод
	|	И СК_ТоварыНаСкладахОстатки.Ячейка = &Ячейка";
	
	Запрос.УстановитьПараметр("Штрихкод",Шк);
	Запрос.УстановитьПараметр("Ячейка",ЭтаФорма.Ячейка.Ссылка);  
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",ЭтаФорма.Номенклатура);
		Отбор.Вставить("Ячейка",ЭтаФорма.Ячейка);
		
		табСобр = ЭтаФорма.ДокОсн.СобранныеТовары.Выгрузить();
		табСобр.Свернуть("Номенклатура,Ячейка","Количество");
		Строки = табСобр.НайтиСтроки(Отбор); 
		
		//тзтовары = Обработки.СК_МобСклад.ПреобразоватьМассивВТаблицуЗначений(Строки);
		
		Если Строки.Количество()=1 Тогда
			Если Строки[0].Количество + 1 <= ЭтаФорма.КоличествоПоДокументу Тогда
				Д = ЭтаФорма.ДокОсн.ПолучитьОбъект();
				
				Т = Д.СобранныеТовары.Добавить();
				Т.Номенклатура = ЭтаФорма.Номенклатура;
				Т.Количество = 1;
				Т.Ячейка = ЭтаФорма.Ячейка;
				Т.ВремяНабора = ТекущаяДата();	
				Д.Записать(РежимЗаписиДокумента.Проведение);
				
        		ЭтаФорма.КоличествоОстаток = ЭтаФорма.КоличествоОстаток-1; 
				КоличествоОстатокПриИзмененииНаСервере();
				
			Иначе
				Сообщить("Остаток превышен!!!");
			КонецЕсли;
			
		Иначе
			
			Если ЭтаФорма.КоличествоОстаток-1 >=0 Тогда 

				Д = ЭтаФорма.ДокОсн.ПолучитьОбъект();
				
				Т = Д.СобранныеТовары.Добавить();
				Т.Номенклатура = ЭтаФорма.Номенклатура;
				Т.Количество = 1;
				Т.Ячейка = ЭтаФорма.Ячейка;
				Т.ВремяНабора = ТекущаяДата();	
				Д.Записать(РежимЗаписиДокумента.Проведение);
				
        		ЭтаФорма.КоличествоОстаток = ЭтаФорма.КоличествоОстаток-1; 
				КоличествоОстатокПриИзмененииНаСервере();
			Иначе
				Сообщить("Остаток превышен!!!");
			КонецЕсли;
			
		КонецЕсли;
		
		ТабЯчеек.Очистить();
		
		ТоварВЯчейке = Обработки.СК_МобСклад.ПолучитьЯчейкиПоКоличеству(ЭтаФорма.Номенклатура,ЭтаФорма.КоличествоПоДокументу); 
		
		ТабЯчеек.Загрузить(Обработки.СК_МобСклад.ПреобразоватьМассивВТаблицуЗначений(ТоварВЯчейке));	

		
	Иначе	
			ЭтаФорма.Элементы.ИнфоТовар.Заголовок = "В ячейках нет товара";  
			ЭтаФорма.Элементы.ИнфоТовар.ЦветТекста = WebЦвета.Красный;
			ЭтаФорма.Элементы.ИнфоТовар.Видимость = Истина; 
			Возврат 0;
		
	КонецЕсли;
	
	
КонецФункции


&НаСервере
Процедура КоличествоПриИзмененииНаСервере() 
		ЭтаФорма.Элементы.ИнфоТовар.Заголовок = "";
		ЭтаФорма.Элементы.ИнфоТовар.ЦветТекста = WebЦвета.Красный;
		ЭтаФорма.Элементы.ИнфоТовар.Видимость = Ложь;
	
	Если ((ЭтаФорма.КоличествоОстаток - ЭтаФорма.Количество) >= 0) Тогда
		остатокЯчейка = ОстатокПоЯчейке(ЭтаФорма.Номенклатура,ЭтаФорма.Ячейка,ЭтаФорма.Количество);
		Если остатокЯчейка = Истина Тогда 
				Д = ЭтаФорма.ДокОсн.ПолучитьОбъект();
				
				Т = Д.СобранныеТовары.Добавить();
				Т.Номенклатура = ЭтаФорма.Номенклатура;
				Т.Количество = ЭтаФорма.Количество;
				Т.Ячейка = ЭтаФорма.Ячейка;
				Т.ВремяНабора = ТекущаяДата();	
				Д.Записать(РежимЗаписиДокумента.Проведение);

				ЭтаФорма.КоличествоОстаток = ЭтаФорма.КоличествоОстаток - ЭтаФорма.Количество	;   

				КоличествоОстатокПриИзмененииНаСервере();

				ТабЯчеек.Очистить();

				ТоварВЯчейке = Обработки.СК_МобСклад.ПолучитьЯчейкиПоКоличеству(ЭтаФорма.Номенклатура,ЭтаФорма.КоличествоПоДокументу); 
				
				ТабЯчеек.Загрузить(Обработки.СК_МобСклад.ПреобразоватьМассивВТаблицуЗначений(ТоварВЯчейке));	
			
		Иначе
			ЭтаФорма.Элементы.ИнфоТовар.Заголовок = "Превышено количество";
			ЭтаФорма.Элементы.ИнфоТовар.ЦветТекста = WebЦвета.Красный;
			ЭтаФорма.Элементы.ИнфоТовар.Видимость = Истина;
		КонецЕсли; 
	Иначе
		ЭтаФорма.Элементы.ИнфоТовар.Заголовок = "Превышено количество";
		ЭтаФорма.Элементы.ИнфоТовар.ЦветТекста = WebЦвета.Красный;
		ЭтаФорма.Элементы.ИнфоТовар.Видимость = Истина;
	КонецЕсли;
	ЭтаФорма.Количество = 0;
КонецПроцедуры


&НаСервере
Функция ОстатокПоЯчейке(Номенклатура,Ячейка,ВналичииОстаток)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК ВналичииОстаток
	               |ИЗ
	               |	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
	               |ГДЕ
	               |	СК_ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
	               |	И СК_ТоварыНаСкладахОстатки.Ячейка = &Ячейка
	               |	И СК_ТоварыНаСкладахОстатки.ВналичииОстаток >= &ВналичииОстаток";
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Ячейка",Ячейка);
	Запрос.УстановитьПараметр("ВналичииОстаток",ВналичииОстаток);
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Количество()>=1 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	КоличествоПриИзмененииНаСервере(); 
	КоличествоОстатокПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоОстатокПриИзменении()
	Если Элементы.Собран.Заголовок = "Товар собран"  Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение,"Товар собран",5,"Внимание!!!");
	КонецЕсли;		
		
КонецПроцедуры                                            

&НаКлиенте
Процедура ПослеЗакрытияПредупреждение(Параметры) Экспорт
	ЭтаФорма.Закрыть();
КонецПроцедуры



&НаСервере
Процедура КоличествоОстатокПриИзмененииНаСервере()

	ЭтаФорма.Элементы.Собран.Заголовок = "";
	ЭтаФорма.Элементы.Собран.Видимость = Ложь;
	
	Если ЭтаФорма.КоличествоОстаток = 0 Тогда
		ЭтаФорма.Элементы.ИнформацияПоТовару.Доступность = Ложь;
		ЭтаФорма.Элементы.Собран.Заголовок = "Товар собран"; 
		ЭтаФорма.Элементы.Собран.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры
